Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: དེ་ལ་ནི་གཟུགས་མེད་དོ། །ཚོར་བ་མེད་དོ། །འདུ་ཤེས་མེད་དོ། །འདུ་བྱེད་རྣམས་མེད་དོ། །རྣམ་པར་ཤེས་པ་མེད་དོ། །
en: Therein there are no physical forms, no feelings, no perceptions, no formative predispositions, and no consciousness.

source: དེ་ལ་ནི་མིག་མེད་དོ། །རྣ་བ་མེད་དོ། །སྣ་མེད་དོ། །ལྕེ་མེད་དོ། ལུས་མེད་དོ། །ཡིད་མེད་དོ། །གཟུགས་རྣམས་མེད་དོ། །སྒྲ་རྣམས་མེད་དོ། །དྲི་རྣམས་མེད་དོ། །རོ་རྣམས་མེད་དོ། །རེག་རྣམས་མེད་དོ། །ཆོས་རྣམས་མེད་དོ། །དེ་ལ་ནི་མིག་གི་ཁམས་མེད་དོ། །གཟུགས་ཀྱི་ཁམས་མེད་དོ། །
en: Therein, there are no eyes, no ears, no nose, no tongue, no body, no mental faculty, no sights, no sounds, no odors, no tastes, no tangibles, and no mental phenomena.

source: མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །རྣ་བའི་ཁམས་མེད་དོ། །སྒྲའི་ཁམས་མེད་དོ། །རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །སྣའི་ཁམས་མེད་དོ། །དྲིའི་ཁམས་མེད་དོ། །སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །ལྕེའི་ཁམས་མེད་དོ། །རོའི་ཁམས་མེད་དོ། །ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །ལུས་ཀྱི་ཁམས་མེད་དོ། །རེག་པའི་ཁམས་མེད་དོ། །ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །ཡིད་ཀྱི་ཁམས་མེད་དོ། །ཆོས་ཀྱི་ཁམས་མེད་དོ། །ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །
en: “Therein, there is no sensory element of the eyes, no sensory element of sights, no sensory element of visual consciousness, no sensory element of the ears, no sensory element of sounds, no sensory element of auditory consciousness, no sensory element of the nose, no sensory element of odors, no sensory element of olfactory consciousness, no sensory element of the tongue, no sensory element of tastes, no sensory element of gustatory consciousness, no sensory element of the body, no sensory element of tangibles, no sensory element of tactile consciousness, no sensory element of the mental faculty, no sensory element of mental phenomena, and no sensory element of mental consciousness.

source: དེ་ལ་ནི་སྡུག་བསྔལ་མེད་དོ། །ཀུན་འབྱུང་བ་མེད་དོ། །འགོག་པ་མེད་དོ། །ལམ་མེད་དོ། །དེ་ལ་ནི་མ་རིག་པ་མེད་དོ། །མ་རིག་པ་འགག་པ་མེད་དོ། །འདུ་བྱེད་རྣམས་མེད་དོ། །འདུ་བྱེད་འགག་པ་མེད་དོ། །
en: “Therein there is no [truth of] suffering, no [truth of] the origin of suffering, no [truth of] the cessation of suffering, and no [truth of] the path.

source: རྣམ་པར་ཤེས་པ་མེད་དོ། །རྣམ་པར་ཤེས་པ་འགག་པ་མེད་དོ། །མིང་དང་གཟུགས་མེད་དོ། །མིང་དང་གཟུགས་འགག་པ་མེད་དོ། །སྐྱེ་མཆེད་དྲུག་མེད་དོ། །སྐྱེ་མཆེད་དྲུག་འགག་པ་མེད་དོ། །རེག་པ་མེད་དོ། །རེག་པ་འགག་པ་མེད་དོ། །ཚོར་བ་མེད་དོ། །ཚོར་བ་འགག་པ་མེད་དོ། །སྲེད་པ་མེད་དོ། །སྲེད་པ་འགག་པ་མེད་དོ། །ལེན་པ་མེད་དོ། །ལེན་པ་འགག་པ་མེད་དོ། །སྲིད་པ་མེད་དོ། །སྲིད་པ་འགག་པ་མེད་དོ། །སྐྱེ་བ་མེད་དོ། །སྐྱེ་བ་འགག་པ་མེད་དོ། །དེ་ལ་ནི་རྒ་ཤི་མེད་དོ། །རྒ་ཤི་འགག་པ་མེད་དོ། །
en: “Therein, there is no fundamental ignorance, no cessation of fundamental ignorance, no formative predispositions, no cessation of formative predispositions, no consciousness, no cessation of consciousness, no name and form, no cessation of name and form, no six sense fields, no cessation of the six sense fields, no sensory contact, no cessation of sensory contact, no sensation, no cessation of sensation, no craving, no cessation of craving, no grasping, no cessation of grasping, no rebirth process, no cessation of rebirth process, no actual birth, no cessation of actual birth, no aging and death, and no cessation of aging and death.

source: དེ་ལ་ནི་འཐོབ་པ་མེད་དོ། །མངོན་པར་རྟོགས་པ་མེད་དོ། །དེ་ལ་ནི་རྒྱུན་དུ་ཞུགས་པ་མེད་དོ། །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མེད་དོ། །
en: “Therein, there is no attainment.

source: ལན་ཅིག་ཕྱིར་འོང་བ་མེད་དོ། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་མེད་དོ། །
en: There is no clear realization.

source: ཕྱིར་མི་འོང་བ་མེད་དོ། །ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མེད་དོ། །དགྲ་བཅོམ་པ་མེད་དོ། །དགྲ་བཅོམ་པའི་འབྲས་བུ་མེད་དོ། །རང་བྱང་ཆུབ་མེད་དོ། །
en: Therein, there is no one entering the stream, no fruit of entering the stream, no one being tied to one more rebirth, no fruit of being tied to one more rebirth, no one who will no longer be subject to rebirth, no fruit of no longer being subject to rebirth, no arhatship, no fruit of arhatship, no individual enlightenment, and no pratyekabuddha.

source: རང་སངས་རྒྱས་མེད་དོ། །དེ་ལ་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེད་དོ། །ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མེད་དོ། །
en: Therein, there is no attainment of completely perfect buddhahood, and no genuinely perfect enlightenment.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ་ནི་བརྩོན་པ་ཞེས་བྱའོ། །
en: “Śāradvatī­putra, great bodhisattva beings who practice the transcendent perfection of wisdom accordingly are said to engage in union.

source: དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པའམ། མི་བརྩོན་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: When they practice the transcendent perfection of wisdom accordingly, they do not consider whether or not they engage in union with the transcendent perfection of wisdom.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པའམ། མི་བརྩོན་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: They do not consider whether or not they engage in union with the transcendent perfection of generosity, with the transcendent perfection of ethical discipline, with the transcendent perfection of tolerance, with the transcendent perfection of perseverance, or with the transcendent perfection of meditative concentration.

source: དེ་བཞིན་དུ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་བརྩོན་པའམ། མི་བརྩོན་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: “Similarly, they do not consider whether or not they engage in union with the applications of mindfulness.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་བར་ལ་བརྩོན་པའམ། མི་བརྩོན་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: In the same vein, they do not consider whether or not they engage in union with the noble eightfold path or [with all the other causal and fruitional attributes], up to and including the ten powers of the tathāgatas.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ལ་བརྩོན་པའམ། མི་བརྩོན་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་བརྩོན་པའམ། མི་བརྩོན་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: In the same vein, they do not consider whether or not they engage in union with the eighteen distinct qualities of the buddhas or [with all other attainments], up to and including omniscience.

source: ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པ་ནི། བརྩོན་ཞེས་བྱའོ། །
en: Śāradvatī­putra, it is for these reasons that great bodhisattva beings who engage in union with the transcendent perfection of wisdom are said to engage in union.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བ་ཡིན་ནོ། །
en: “Śāradvatī­putra, great bodhisattva beings who engage in union with the transcendent perfection of wisdom are approaching omniscience.

source: དེ་ཇི་ལྟ་ཇི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བ་དེ་ལྟ་དེ་ལྟར་ལུས་ཡོངས་སུ་དག་པ་དང་། ངག་ཡོངས་སུ་དག་པ་དང་། སེམས་ཡོངས་སུ་དག་པ་དང་། མཚན་ཡོངས་སུ་དག་པ་ཐོབ་པར་འགྱུར་རོ། །དེ་ཇི་ལྟ་ཇི་ལྟར་ལུས་ཡོངས་སུ་དག་པ་དང་།
en: Commensurate with their approach to omniscience, they attain complete purity of the body, complete purity of speech, complete purity of mind, and complete purity of defining marks.

source: ངག་ཡོངས་སུ་དག་པ་དང་། སེམས་ཡོངས་སུ་དག་པ་དང་། མཚན་ཡོངས་སུ་དག་པ་ཐོབ་པ་དེ་ལྟ་དེ་ལྟར་འདོད་ཆགས་དང་ལྡན་པའི་སེམས་མི་སྐྱེད་དོ། །དེ་བཞིན་དུ་ཞེ་སྡང་དང་ལྡན་པ་དང་། གཏི་མུག་དང་ལྡན་པའི་སེམས་མི་སྐྱེད་དོ། །ང་རྒྱལ་དང་ལྡན་པ་དང་།
en: Commensurate with their attainment of complete purity of the body, complete purity of speech, complete purity of mind, and complete purity of defining marks, they do not entertain thoughts of desire, and similarly, they do not entertain thoughts of hatred and delusion.

source: གཡོ་དང་སྒྱུ་དང་ལྡན་པ་དང་། ཆགས་པ་དང་ལྡན་པ་དང་། སེར་སྣ་དང་། ཕྲག་དོག་དང་ལྡན་པ་དང་། ལྟ་བ་ཐམས་ཅད་དང་ལྡན་པའི་སེམས་མི་སྐྱེད་དོ། །
en: They do not entertain thoughts of pride, pretentiousness, deceit, attachment, miserliness, envy, or all sorts of [mistaken] views.

source: དེས་འདོད་ཆགས་ཀྱི་སེམས་མ་བསྐྱེད་ཅིང་། དེ་བཞིན་དུ་ལྟ་བ་ཐམས་ཅད་དང་ལྡན་པའི་བར་གྱི་སེམས་མ་བསྐྱེད་པས་ན་མ་ཡང་མའི་མངལ་དུ་མི་སྐྱེ་སྟེ། རྟག་ཏུ་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ། །
en: Since they do not entertain thoughts of desire, and similarly, they do not entertain [any other such thoughts], up to and including the plethora of [mistaken] views, they are never conceived within a mother’s womb, and they will invariably be born miraculously.

source: སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་མ་གཏོགས་པར་ནམ་ཡང་ངན་སོང་རྣམས་སུ་མི་སྐྱེའོ། །
en: Except in order to bring sentient beings to maturation, they will never be born in the inferior realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོའོ། །
en: They will proceed from one field to another field.

source: སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་ལ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ཀྱི་བར་དུ་ནམ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་འབྲལ་བར་མི་འགྱུར་རོ། །
en: They will bring sentient beings to maturation, they will completely refine the fields, and they will never be separated from the lord buddhas until they attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་དང་ཕན་ཡོན་དེ་དག་ཐོབ་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་བརྩོན་པ་མི་འདོར་བར་རྟག་ཏུ་དེ་ལྟར་བརྩོན་པར་བྱའོ། །
en: “Consequently, Śāradvatī­putra, great bodhisattva beings who wish to attain these enlightened attributes and advantages should engage in union in that manner, at all times, without abandoning their engagement with the transcendent perfection of wisdom.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྣལ་འབྱོར་འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་ཀྱི་རྣལ་འབྱོར་འདི་ནི་མཆོག་ཡིན་པའི་ཕྱིར་རོ། །
en: If you ask why, Śāradvatī­putra, it is because this union of great bodhisattva beings, this union of emptiness, is supreme.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་རྣལ་འབྱོར་འདི་ནི་དེ་ལས་གཞན་པའི་རྣལ་འབྱོར་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ནས་གནས་སོ། །
en: “Śāradvatī­putra, this union whereby great bodhisattva beings practice the transcendent perfection of wisdom endures when all other engagements have been surpassed.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣལ་འབྱོར་འདི་ལ་གནས་པ་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་མངོན་པར་སྒྲུབ་བོ། མི་འཇིགས་པ་བཞི་དང་།
en: Śāradvatī­putra, great bodhisattva beings who maintain this union achieve the ten powers of the tathāgatas.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་མངོན་པར་སྒྲུབ་བོ། །
en: They achieve the four assurances, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣལ་འབྱོར་འདི་ལ་གནས་པ་ནི། ནམ་ཡང་སེར་སྣའི་སེམས་མི་སྐྱེད་དོ། །
en: Śāradvatī­putra, great bodhisattva beings who maintain this union never entertain thoughts of miserliness.

source: འཆལ་བའི་ཚུལ་ཁྲིམས་ཀྱི་སེམས་དང་། འཁྲུག་པའི་སེམས་དང་། ལེ་ལོའི་སེམས་དང་། རྣམ་པར་གཡེངས་པའི་སེམས་དང་། ཤེས་རབ་འཆལ་བའི་སེམས་མི་སྐྱེད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དང་།
en: They never entertain thoughts of degenerate morality, thoughts of agitation, thoughts of indolence, thoughts of distraction, or thoughts of stupidity.”

source: ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་དང་། དེ་དག་དང་གཞན་ཡང་དགེ་སློང་མངོན་པར་གྲགས་པ་རབ་ཏུ་མང་པོ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་དང་། དགེ་བསྙེན་དང་དགེ་བསྙེན་མ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the venerable Śāradvatī­putra, the venerable Mahā­maudgalyāyana, the venerable Su­bhūti, the venerable Mahākāśyapa, the venerable Pūrṇa­maitrāyaṇī­putra, and in addition to them, a multitude of renowned fully ordained monks, as well as assemblies of great bodhisattva beings, laymen and laywomen, all addressed the Blessed One as follows: “Reverend Lord!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཆེ་བ་ལགས་སོ། །
en: This transcendent perfection of great bodhisattva beings is great. Reverend Lord!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་རྒྱ་ཆེ་བ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མཆོག །
en: This transcendent perfection of great bodhisattva beings is supreme among the vast transcendent perfections.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྱད་པར་དུ་འཕགས་པ།
en: It is the particularly sublime transcendent perfection.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་རབ་མཆོག །
en: It is the most excellent transcendent perfection.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་བླ་ན་མ་མཆིས་པ།
en: It is the unsurpassed transcendent perfection.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་གོང་ན་མ་མཆིས་པ་ལགས་ཏེ།
en: It is the highest transcendent perfection.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ།
en: Reverend Lord!

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མི་མཉམ་པ་དང་མཉམ་པ།
en: This transcendent perfection of wisdom is equal to the unequaled transcendent perfection of great bodhisattva beings!

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞི་བ་དུལ་བ།
en: Transcendent perfection is calm and peaceful.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ།
en: Transcendent perfection is empty of its own defining characteristics.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོན་ཏན་ཐམས་ཅད་ཡོངས་སུ་རྒྱས་པ།
en: Transcendent perfection is the emptiness of the essential nature of non-entities. Transcendent perfection is extensive in all enlightened attributes.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོན་ཏན་ཐམས་ཅད་དང་ལྡན་པ།
en: Transcendent perfection is endowed with all enlightened attributes.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་མི་རྫི་བ་ཉིད་ལགས་སོ། །
en: Transcendent perfection is a state of uncrushability. “Reverend Lord!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཆོག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ།
en: Those who are supreme among great bodhisattva beings practice the transcendent perfection of wisdom.

source: མི་མཉམ་པ་དང་མཉམ་པའི་སྦྱིན་པ་སྩལ་བ།
en: They bestow generosity that is equal to the unequaled.

source: མི་མཉམ་པ་དང་མཉམ་པའི་སྦྱིན་པ་ཡོངས་སུ་རྫོགས་པ།
en: They perfect generosity that is equal to the unequaled.

source: མི་མཉམ་པ་དང་མཉམ་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པ།
en: They perfect the transcendent perfection of generosity that is equal to the unequaled.

source: མི་མཉམ་པ་དང་མཉམ་པའི་ལུས་ཐོབ་པ། མི་མཉམ་པ་དང་མཉམ་པའི་ཆོས་ཐོབ་པ་རྣམས་ཀྱིས་ནི་འདི་ལྟ་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་བགྱིད་ལགས་སོ། །
en: They obtain a physical form that is equal to the unequaled, and they attain attributes that are equal to the unequaled, whereby they attain the unsurpassed, genuinely perfect enlightenment.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པར་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་ཡང་དེ་བཞིན་དུ་བགྱིའོ། །
en: In the same vein, just as it has been stated here in relation to the transcendent perfection of generosity, so it is with the other transcendent perfections, up to and including the transcendent perfection of wisdom.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ལ་སྤྱད་ནས། མི་མཉམ་པ་དང་མཉམ་པའི་ཆོས་བརྙེས་པར་གྱུར་ལགས་སོ། །
en: “Reverend Lord! You, O Lord, also acquired the sacred doctrine that is equal to the unequaled though practicing this transcendent perfection of wisdom.

source: དེ་བཞིན་དུ་མི་མཉམ་པ་དང་མཉམ་པའི་གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། མི་མཉམ་པ་དང་མཉམ་པའི་རྣམ་པར་ཤེས་པ་བརྙེས་པར་གྱུར་ལགས་སོ། །
en: Likewise, you acquired physical forms, feelings, perceptions, formative predispositions, and consciousness that are equal to the unequaled.

source: དེ་བཞིན་དུ་མི་མཉམ་པ་དང་མཉམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ལགས་སོ། །
en: Likewise, you turned the wheel of the sacred doctrine that is equal to the unequaled.

source: འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ལ་སྤྱད་ནས། མི་མཉམ་པ་དང་མཉམ་པའི་ཆོས་བརྙེས་པར་གྱུར་ལགས་སོ། །མི་མཉམ་པ་དང་མཉམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་བར་དུ་གྱུར་ལགས་སོ། །
en: The lord buddhas of the past also acquired their sacred doctrines that are equal to the unequaled, after practicing this transcendent perfection of wisdom, and they turned the wheel of the sacred doctrine that is equal to the unequaled.

source: དེ་བཞིན་དུ་མ་འོངས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ལ་སྤྱད་ནས། མི་མཉམ་པ་དང་མཉམ་པའི་ཆོས་བརྙེས་པར་གྱུར་ལགས་སོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། མི་མཉམ་པ་དང་མཉམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་བར་དུ་གྱུར་ལགས་སོ། །
en: Likewise, the lord buddhas of the future also will acquire their sacred doctrines that are equal to the unequaled after practicing this transcendent perfection of wisdom; and, in the same vein, they will turn the wheel of the sacred doctrine that is equal to the unequaled.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་ལྟར་ལགས་པས་པས་ན།
en: Reverend Lord!

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་མཆི་བར་འཚལ་བས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣལ་འབྱོར་གྱིས་གནས་པར་བགྱིའོ། །
en: Since this is the case, great bodhisattva beings who seek to transcend all phenomena should continue to engage in union with the transcendent perfection of wisdom.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then addressed those great śrāvakas and those great bodhisattva beings as follows: “O wise ones!

source: ཤེས་ལྡན་དག་རིགས་ཀྱི་བུ་དག་དེ་དེ་བཞིན་ཏེ།
en: O children of enlightened heritage! It is so!

source: དེ་དེ་བཞིན་ནོ། །
en: It is so!

source: ཤེས་ལྡན་དག་རིགས་ཀྱི་བུ་དག་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: O wise ones! O children of enlightened heritage! It is just as you have said! O wise ones!

source: ཤེས་ལྡན་དག་རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣལ་འབྱོར་འདིས་གནས་པ་དེ་དག་ནི་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཕྱག་བྱ་བར་འོས་པ་ཡིན་ནོ། །
en: O children of enlightened heritage! Those great bodhisattva beings who continue to engage in union with the transcendent perfection of wisdom deserve the respect of the entire world with its gods, humans and antigods.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ་ལས་རྣལ་འབྱོར་གྱི་ལེའུ་ཞེས་བྱ་སྟེ་བཞི་པའོ།། །།
en: This completes the fourth chapter from “The Transcendent Perfection of Wisdom in Ten Thousand Lines,” entitled “Union.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Designation of a Bodhisattva Chapter 5 Then, the venerable Śāradvatī­putra asked the Blessed One, “Reverend Lord!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣལ་འབྱོར་འདིས་གནས་པ་དེ་དག་ནི་ཕྱག་བྱ་བར་འོས་པ་ཡིན་ནོ་ཞེས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣལ་འབྱོར་དེ་དག་དང་། རྟག་ཏུ་མ་བྲལ་བར་གནས་པ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བའི་ཆོས་དེ་གང་ལགས། དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟ་སྟེ།
en: When you say that great bodhisattva beings who continue to engage in union with the transcendent perfection of wisdom deserve respect, then, Reverend Lord, what constitutes that phenomenon designated by the term ‘bodhisattva,’ that is to say, the one who at all times continues to engage inseparably in union with the transcendent perfection of wisdom?

source: བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བའི་ཆོས་དེ་བདག་གིས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བའི་སླད་དུའོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: If one were to ask why, it is because I do not consider any phenomenon that may be designated by the term ‘bodhisattva.’” The Blessed One addressed the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, do you think that physical forms constitute a bodhisattva?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་མ་ལགས་སོ། །
en: “No, Reverend Lord!” he replied.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that feelings, perceptions, formative predispositions, and consciousness constitute a bodhisattva?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་མ་ལགས་སོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “No, Reverend Lord!”

source: མིག་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ། དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་པའམ།
en: “Śāradvatī­putra, do you think that the eyes constitute a bodhisattva, and similarly, do you think that the ears, nose, tongue, body, and mental faculty constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ། དེ་བཞིན་དུ་སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that sights constitute a bodhisattva, and similarly, do you think that sounds, odors, tastes, tangibles, and mental phenomena constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། རྣ་བའི་ཁམས་དང་། སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the sensory element of the ears, the sensory element of sounds, and the sensory element of auditory consciousness constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the sensory element of the nose, the sensory element of odors, and the sensory element of olfactory consciousness constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the sensory element of the tongue, the sensory element of tastes, and the sensory element of gustatory consciousness constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ལུས་ཀྱི་ཁམས་དང་། རེག་བྱའི་ཁམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the sensory element of the body, the sensory element of tangibles, and the sensory element of tactile consciousness constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the sensory element of the mental faculty, the sensory element of mental phenomena, and the sensory element of mental consciousness constitute a bodhisattva?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་མ་ལགས་སོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སའི་ཁམས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “No, Reverend Lord!”

source: དེ་བཞིན་དུ་ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the earth element constitutes a bodhisattva, and similarly, do you think that the water element, the fire element, the wind element, the space element, and the consciousness element constitute a bodhisattva?”
